import * as agen from '../dist/agen-encoding-esm.js';

const f = agen.decodeBlocks();

const blocks = [
  Uint8Array.from([
    209, 129, 209, 138, 208, 181, 209, 136, 209, 140,
    32, 208, 182, 208, 181, 10, 32, 208, 181, 209,
    137, 209, 145, 32, 209, 141, 209, 130, 208, 184,
    209, 133, 10, 32, 208, 188, 209, 143, 208, 179,
    208, 186, 208, 184, 209, 133, 32, 209, 132, 209,
    128, 208, 176, 208, 189, 209, 134, 209, 131, 208,
    183, 209, 129
  ]),
  Uint8Array.from([
    208, 186, 208, 184, 209, 133, 32, 10,
    208, 177, 209, 131, 208, 187, 208, 190,
    208, 186, 44, 32, 208, 180, 208, 176,
    32, 208, 178, 209, 139, 208, 191, 208,
    181, 208, 185, 10, 209, 135, 208, 176,
    209, 142
  ])
];

for await (let info of f(blocks)) {
  console.log(`-----------`)
  console.log('*', info);
}
// Output:
// -----------
// * {
//   charIdx: 0,
//   charLen: 35,
//   byteIdx: 0,
//   byteLen: 63,
//   firstLine: 0,
//   firstPos: 0,
//   lastLine: 2,
//   lastPos: 16,
//   data: 'съешь же\n ещё этих\n мягких французс'
// }
// -----------
// * {
//   charIdx: 35,
//   charLen: 24,
//   byteIdx: 63,
//   byteLen: 42,
//   firstLine: 2,
//   firstPos: 16,
//   lastLine: 4,
//   lastPos: 3,
//   data: 'ких \nбулок, да выпей\nчаю'
// }
